Revit 2027 API
ParameterTypeId.ViewSolarstudyAnimationSpeedValue Property
 "Loop animation speed"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyAnimationSpeedValue { get; }
Public Shared ReadOnly Property ViewSolarstudyAnimationSpeedValue As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyAnimationSpeedValue {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyAnimationSpeedValue : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace